Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: ལས་དང་འགལ་བའི་ཚིག་གམ།
en: speech that contradicts the workings of karma;

source: རྗེས་སུ་འཐུན་པ་མ་ཡིན་པའི་ཚིག་མི་འབྱིན་ཏོ། །
en: or speech in which one fails to avoid using words that do not accord with reality.

source: ཞི་བའི་བློ་གྲོས་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ངག་ནི་སྒྲའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། བསོད་ནམས་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་གྲུབ་པས་བདེན་པའི་རྗེས་སུ་འབྲང་བ་དང་ལྡན་པ་ཡིན་ཏེ།
en: “Śāntamati, the expression of the bodhisattvas’ speech is infused with the knowledge of the supernormal faculties, and because it results from the ripening of merit, it accords with the truth.

source: དེ་གང་སྨྲ་བ་དེ་དེ་ལྟ་བུ་ཉིད་ཡིན་ནོ། །གལ་ཏེ་དེ་ཤིང་དྲུང་ན་འདུག་གམ། འཆག་གམ། འདུག་གམ། ཉལ་ཡང་རུང་།
en: Whatever they say is just exactly so.

source: ལ་ལ་ཞིག་འོངས་ནས་ཀྱེ་སྐྱེས་བུ་ཤིང་ལྗོན་པ་འདི་དག་ལ་འདབ་མ་ཇི་སྙེད་ཅིག་ཡོད་ཅེས་ཟེར་ན་དེ་ཤིང་ལྗོན་པ་དེ་ལ་ཡང་མི་ལྟ། འདབ་མ་ལ་ཡང་མི་བགྲང་བར་ཤིང་ལྗོན་པ་དེ་ལ་འདབ་མ་ཇི་སྙེད་ཡོད་པ་བཞིན་དུ་མི་ཉུང་མི་མང་བར་འདི་སྙེད་ཅིག་གོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ངག་འབྱུང་ངོ་། །ཡང་གང་གཱའི་བྱེ་མའི་འབྲུ་དེ་བརྒྱ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། སྟོང་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། འབུམ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད།
en: Suppose a bodhisattva were to pass by or sit under a tree and somebody were to ask, ‘Excuse me, sir, how many leaves does this tree have?’ Without looking at the tree and without counting the leaves, the bodhisattva would then be able to say exactly how many leaves there were without overestimating or underestimating the number.

source: བྱེ་བ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། ཐེར་འབུམ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། ཁྲག་ཁྲིག་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། དཀྲིགས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། གཏམས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། ཁྱད་ཕྱིན་ཇི་སྙེད་ཅིག་ཡོད། མི་འཁྲུགས་པ་ཇི་སྙེད་ཅིག་ཡོད། དཔག་ཏུ་མེད་པ་ཇི་སྙེད་ཅིག་ཡོད། གྲངས་མེད་པ་ཇི་སྙེད་ཅིག་ཡོད། གཏན་པ་ཇི་སྙེད་ཅིག་ཡོད། ཕྱིན་བྱེད་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད།
en: “Also, if one were to ask, ‘How many hundreds, thousands, hundreds of thousands, millions, billions, hundreds of billions, trillions, quadrillions, quintillions, sextillions, septillions, octillions, nonillions, decillions, undecillions, and duodecillions of grains of sand are there in the Ganges?’ then, without looking or counting, the bodhisattva’s speech could declare exactly how many grains of sand there are.

source: སྟོབས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། གླང་པོ་ཆེའི་སྟོབས་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད། བགྲང་བ་ཕྲག་ཇི་སྙེད་ཅིག་ཡོད་ཅེས་འདྲི་ན་དེ་བྱེ་མ་དེ་དག་ལ་ཡང་མི་ལྟ་མི་བགྲང་བར་བྱེ་མའི་འབྲུ་དེ་དག་ཇི་སྙེད་ཡོད་པ་བཞིན་དུ་འདི་སྙེད་ཅིག་གོ །ཞེས་བྱང་ཆུབ་སེམས་དཔའ་དེའི་ངག་འབྱུང་སྟེ། བྱེ་མ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱིས་འདི་སྙེད་ཅིག་ཡོད་དོ་ཞེས་མཁྱེན་པ་ཡིན་ནོ། །
en: He knows the grains of sand to be this precise number by using the knowledge of the realized ones.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཉིད་མངོན་སུམ་དུ་གྱུར་པ་མ་གཏོགས་པར་ལྷ་འམ།
en: Śāntamati, only the realized ones can directly perceive this.

source: ཀླུ་འམ། གནོད་སྦྱིན་ནམ། དྲི་ཟ་འམ། ལྷ་མ་ཡིན་ནམ། རླུང་ལྷའམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅི་འམ། ལྟོ་འཕྱེ་ཆེན་པོ་འམ། ཉན་ཐོས་སམ།
en: It is not directly perceptible to gods, nāgas, yakṣas, gandharvas, asuras, marutas, garuḍas, kinnaras, mahoragas, disciples, or solitary buddhas.

source: རང་སངས་རྒྱས་ཀྱི་མངོན་སུམ་ནི་མ་ཡིན་ནོ། །ཞི་བའི་བློ་གྲོས་རྣམ་གྲངས་འདིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེའི་དུས་ན་བྲམ་ཟ་སྔོ་སངས་ཞེས་བྱ་བ་ཞིག་ཀྱང་བྱུང་ངོ་། །
en: “Śāntamati, you can understand this through the following teaching: At one point in the past, Śāntamati, there was a sage named Light and a brahmin named Śyāmaka.

source: ཡང་དེའི་དུས་ན་ཤིང་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་བཟང་པོ་ཞེས་བྱ་བ་ཡལ་ག་དང་འདབ་མ་མང་པོས་ཡོག་པ།
en: At that time, there was a tree called the Excellent King of Banyan Trees, which was covered by many branches and leaves.

source: ཁོར་ཡུག་ཏུ་ཚད་རྒྱང་གྲགས་གཅིག་ཡོད་པ་ཞིག་བྱུང་སྟེ་དེར་དྲང་སྲོང་སྣང་བ་དེ་གནས་སོ། །
en: The crown of the tree was several miles in circumference and the sage, Light, dwelled beneath that tree.

source: དེ་ན་གནས་པའི་ཚེ་དེས་མངོན་པར་ཤེས་པའི་སྟོབས་ཀྱིས་ཤིང་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་བཟང་པོ་དེའི་ཡལ་ག་གྲངས་དུ་ཡོད་པ། ལོ་བཅུ་གཉིས་དང་ཞག་བདུན་གྱི་བར་དུ་བགྲངས་ཏེ་རྟོགས་པར་བྱས་ཤེས་པར་བྱས་སོ། །
en: While he was dwelling there, he used the power of his supernormal faculties to count the leaves on the branches of the Excellent King of Banyan Trees for twelve years and seven days until he came to a realization of that knowledge.

source: དེ་ནས་དུས་གཞན་ཞིག་ན་བྲམ་ཟེ་སྔོ་སངས་ཞེས་བྱ་བ་གྲོང་ཁྱེར་ནས་ཁ་ཟས་བསླངས་ཏེ། ཉིན་མོ་གནས་པའི་ཕྱིར་ཤིང་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་བཟང་པོ་ཞེས་བྱ་བ་ག་ལ་བ་དེར་སོང་ནས་ཟས་ཀྱི་བྱ་བ་བྱས་ཏེ།
en: At a certain point the brahmin, Śyāmaka, had been out seeking alms in the village, and because it was midday he went beneath that banyan tree to take his meal.

source: དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བ་ག་ལ་བ་དེར་སོང་ནས་མངོན་སུམ་དུ་ཡང་དག་པར་མགུ་བར་འགྱུར་བ་དང་།
en: He came before the sage, Light, and was truly delighted to see him.

source: ཡང་དག་པར་ཆགས་པར་འགྱུར་བའི་གཏམ་མང་པོ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །
en: Sitting together, they spoke of many topics about which they were passionate.

source: དེ་ནས་དྲང་སྲོང་སྣང་བ་ཞེས་བྱ་བས་བྲམ་ཟེ་སྔོ་སངས་ཞེས་བྱ་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་བྲམ་ཟེ་མིའི་འཇིག་རྟེན་སེམས་ཅན་གྱི་རིས་ན་གང་ཤིང་ནྱ་གྲོ་དྷའི་རྒྱལ་པོ་འདིའི་འདབ་མའི་གྲངས་དུ་ཡོད་པ་རྩི་བ་འམ། རྟོགས་པར་བྱེད་པ་འམ། ཤེས་པར་བྱེད་ནུས་པའི་སེམས་ཅན་འགའ་ཡོད་དམ།
en: Then, the sage, Light, said to the brahmin Śyāmaka, ‘Excuse me, brahmin, but do you think there are any humans in this world of beings who have the ability to count, directly perceive, or know the number of leaves on this Excellent King of Banyan Trees?’

source: སྨྲས་པ་བཙུན་པ་མཆིས་སོ། །
en: “ ‘Yes, revered one, there is.’

source: དྲང་སྲོང་གིས་སྨྲས་པ། བྲམ་ཟེ་དེ་གང་ཡིན།
en: “ ‘Brahmin, who would that be?’ asked the sage.

source: བྲམ་ཟེས་སྨྲས་པ། བཙུན་པ་བདག་གིས་བགྲང་བར་བགྱིའོ། །
en: “The brahmin replied, ‘Revered one, I can count them.’

source: དྲང་སྲོང་གིས་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་དེའི་ཕྱིར་གྲོངས་ཤིག །
en: “ ‘Well, count them, then, brahmin!’ said the sage.

source: དེ་ནས་བྲམ་ཟེ་སྔོ་སངས་དེ་ཤིང་ལྗོན་པ་དེ་ལ་ཡང་མི་ལྟ།
en: “Immediately, without having to look at the tree or count the leaves, the brahmin knew how many leaves there were.

source: འདབ་མ་རྣམས་ལ་ཡང་མི་བགྲང་བར་སྐད་ཅིག་ལ་འདབ་མ་རྟོགས་པ་ལ་ཞུགས་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: He then spoke in verse, saying:

source: མི་འཁྲུགས་དྲུག་ཅུ་པང་སྟེང་ཕྲག །
en: “ ‘There are six hundred septillion,

source: བཅུ་དྲུག་དང་ནི་ཁྱད་ཕྱིན་ཕྲག།
en: Sixteen sextillion,

source: བཅུ་གསུམ་དང་ནི་དཀྲིགས་པ་ཕྲག །
en: Thirteen quintillion,

source: དགུ་བཅུ་རྩ་དྲུག་ཁྲག་ཁྲིག་ཕྲག །
en: Ninety-six quadrillion,

source: སུམ་ཅུ་རྩ་དགུ་ཁྲག་ཁྲིག་ཕྲག།
en: “ ‘Three hundred and ninety trillion,

source: སུམ་ཅུ་དང་ནི་ཐེར་འབུམ་ཕྲག །
en: Thirty billion,

source: བརྒྱད་སྟོང་དང་ཡང་བྱེ་བ་ཕྲག །
en: Eight hundred

source: དགུ་བཅུ་རྩ་གཉིས་འདབ་འདི་མཆིས། །
en: And ninety-two million.

source: བྲམ་ཟེ་དམ་པ་བདག་གིས་འཚལ། །
en: “ ‘I, the true brahmin, know this.’

source: དེ་སྐད་ཐོས་ནས་སྔོ་སངས་ལ། །
en: Hearing this, Light said to Śyāmaka,

source: སྣང་བས་སྨྲས་པ་བྲམ་ཟེའི་མཆོག །ཁྱོད་ནི་བདེན་པའི་ཚིག་སྨྲ་བ། །
en: ‘Best of brahmins, you have spoken truly.

source: ལེགས་སོ་ལེགས་སོ་འདི་བདེན་ནོ། །
en: Excellent, excellent. This is true.

source: ལོ་ནི་ཁྱུད་ཀོར་བཅུ་གཉིས་དང་། །ཉི་མ་བདུན་དུ་མངོན་ཤེས་ཀྱིས། །
en: “ ‘For twelve full years and seven days

source: འདབ་མ་རྣམས་ནི་བདག་གིས་བགྲངས། །
en: Have I, through supernormal faculties, counted these leaves.

source: གཙོ་བོ་ཁྱོད་ཀྱིས་སྐད་ཅིག་མཁྱེན། །
en: Lord, you have known them in an instant.

source: ཁྱེད་ནི་གཟིགས་པ་མི་མཛད་ཅིང་། །
en: Without looking or counting,

source: བགྲང་བ་མི་མཛད་སྐད་ཅིག་ཏུ། །
en: “ ‘You realized instantaneously

source: འདབ་རྟོགས་པ་ཡི་རྗེས་སུ་ཞུགས། །
en: How many leaves there are.

source: མཁྱེན་འདི་ཉིད་ཀྱི་འམ་ལྷ་ཡིས་བསྟན། །
en: Has this knowledge been taught to you by a god?

source: བྲམ་ཟེ་བདག་ལ་དོན་འདི་གསུངས། །སྔོ་སངས་ཀྱིས་སྨྲས་པ།
en: Brahmin, please explain this to me.’

source: ཀྱེ་བཙུན་པ་གསོན་ཅིག །འདི་ནི་ལྷ་ཡིས་སྨྲས་མིན་མི་ཡི་སྟེ། །
en: “ Śyāmaka replied, ‘Listen, revered one, this is not taught by gods, but by men.

source: བདག་ཚིག་བདེན་པའི་རྗེས་འབྲང་དོན་བཞིན་འཇུག །
en: I follow true words and live according to their meaning.

source: ནམ་མཁའ་ཟད་པར་གྲུམ་པར་འགྱུར་སྲིད་ཀྱི། ཁོ་བོ་བརྫུན་དུ་སྨྲ་བ་མི་སྲིད་དོ། །
en: It is possible that the sky could exhaust itself and fall to pieces, but it is impossible for me ever to speak falsely.’ “Then Vajrapāṇi said:

source: སྣང་བར་གྱུར་པ་བདག་ཉིད་ཆེན་པོ་ཤཱ་རིའི་བུ། །
en: “Light was the great one, Śāriputra,

source: བྲམ་ཟེ་སྔོ་སངས་གྱུར་པ་ཤཱཀྱ་སེང་གེ་སྟེ། །
en: And the brahmin, Śyāmaka, was Śākyasiṃha.

source: ཡོན་ཏན་རྒྱ་མཚོ་ལྡན་པ་རྣམས་ཀྱི་ངག་འདི་འདྲ། །
en: Such is the speech of those who possess an ocean of virtues.

source: བདེན་ལ་གནས་ཤིང་དོན་དང་ཆོས་དང་ལྡན་པ་ཡིན། །
en: It is endowed with the Dharma and its meaning, which rests on the truth.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངག་ཡོངས་སུ་དག་པ་ཡིན་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གསང་བ་དང་།
en: “Śāntamati, so far as the purity of the speech of the bodhisattvas is concerned, this is the secret of the speech of the bodhisattvas.

source: ངག་ཡོངས་སུ་དག་པ་ལ་འཇུག་པ་ཅུང་ཟད་ཙམ་ཞིག་བསྟན་པར་ཟད་ཀྱི།
en: This is merely a brief demonstration of the purity of their speech.

source: དེ་བས་གོང་དུ་བསྟན་ན་བྱང་ཆུབ་སེམས་དཔའི་ངག་ཡོངས་སུ་དག་པ་ཚད་ཟིན་པ་འམ་མཐར་ཕྱིན་པར་མི་འགྱུར་རོ། །
en: If one were to go further than that, an exhaustive explanation of the purity of the bodhisattvas’ speech would have no limit or endpoint.”

source: བྱང་ཆུབ་སེམས་དཔའི་ངག་གི་གསང་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། གཉིས་པའོ།། །།
en: This was the second chapter, “The Secret of the Bodhisattva’s Speech.” Chapter 3: The Secret of the Bodhisattva’s Mind

source: གཞན་ཡང་གསང་བ་པའི་བདག་པོ་ལག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ཞི་བའི་བློ་གྲོས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཞི་བའི་བློ་གྲོས་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བ་དང་། སེམས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན།
en: Once again, Vajrapāṇi, Lord of the Guhyakas, spoke to the bodhisattva Śāntamati: “Now, Śāntamati, what is the secret of a bodhisattva’s mind and the purity of his mental action?

source: ཞི་བའི་བློ་གྲོས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡེ་ཤེས་ཀྱིས་བྱས་པའི་ལས་རྣམས་བྱེད་ཀྱི་ང་རྒྱལ་གྱིས་བྱས་པ་རྣམས་མི་བྱེད་དོ། །
en: “Śāntamati, bodhisattvas undertake their work by means of knowledge, not by taking pride in it.

source: མངོན་པར་ཤེས་པ་ལས་ཀྱང་མ་ཉམས་ལ་ཡེ་ཤེས་ཀྱིས་བྱས་པའི་ལས་རྣམས་ཀྱང་བྱེད་དོ། །
en: Also, they undertake their work with knowledge without weakening any of the supernormal faculties.

source: མངོན་པར་ཤེས་པ་ཀྱང་རྣམ་པར་རྩེན་ལ་བྱ་བ་ཐམས་ཅད་ཀྱང་སྟོན་ཏོ། །
en: They manifest all sorts of actions while making child’s play of the supernormal faculties.

source: མངོན་པར་ཤེས་པ་ལ་ཡང་གནས་ལ་འཇུག་པ་ཆེན་པོ་ལ་ཡང་གནས་སོ། །
en: They have attained the great mastery that is the mastery of the supernormal faculties.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་ཀྱི་རྣམ་པ་སྟེ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའོ། །
en: The supernormal faculties they possess are an aspect of knowledge because they are connected with the supreme knowledge of all aspects.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཤེས་རབ་ཀྱི་རྣམ་པ་སྟེ་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་མཐོང་བའོ། །
en: The supernormal faculties they possess are an aspect of wisdom because they provide a direct vision of all things.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་མི་ཟད་པའི་རྣམ་པ་སྟེ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བའོ། །
en: The supernormal faculties they possess have the aspect of inexhaustibility because they conform with everything.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་གཟུགས་ཐམས་ཅད་གཟུགས་མ་ཡིན་པའི་ཕྱིར་གཟུགས་ཐམས་ཅད་མཐོང་བའོ། །
en: Because all forms do not have a form, the supernormal faculties they possess can see all forms.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་སྔོན་གྱི་མཐའ་དང་། ཕྱི་མའི་མཐའི་སྒྲ་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་སྒྲ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའོ། །
en: Because the sounds of the past are the same as the sounds of the future, the supernormal faculties they possess can comprehend all sounds.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་ལྟ་བ་དང་། སེམས་ཀྱི་རང་བཞིན་ལ་སོ་སོར་རྟོག་ཅིང་ལྟ་བའོ། །
en: The supernormal faculties they possess perceive the thoughts of all beings, because they can perceive and thoroughly investigate the true nature of mind.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་བསྐལ་པ་མཐའ་ཡས་པ་རྗེས་སུ་དྲན་པ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་མ་ཆད་པའོ། །
en: The supernormal faculties they possess can recollect limitless eons, because they do not place any limits on the past or the future.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་མངོན་དུ་གྱུར་ཅིང་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་མཚན་ཉིད་དོ། །
en: The supernormal faculties they possess can produce every kind of wondrous transformation with their superhuman powers because they have the defining characteristic of being unconditioned.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཟག་པ་ཟད་པའི་རྗེས་སུ་འཐུན་པ་དང་། དུས་ལ་ལྟ་ཞིང་དུས་ལས་མི་ཡོལ་བའོ། །
en: The supernormal faculties they possess conform to the cessation of the defilements, because they perceive the moment and they never miss the moment.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་འཇིག་རྟེན་ལས་འདས་པ་འཕགས་པ་ལ་མངོན་པར་ཕྱོགས་པའི་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའོ། །
en: The supernormal faculties they possess are conducive to the forms of penetrating insight that are fixed upon what is transcendent and noble.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་རྟོགས་པར་དཀའ་བའོ། །
en: The supernormal faculties they possess are difficult for the disciples and solitary buddhas to understand.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་དོན་ཟབ་ཅིང་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པའོ། །
en: The supernormal faculties they possess have profound meaning and defeat their adversaries, Māra in all his forms.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་སྒྲུབ་ཅིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་མཆོག་གོ །
en: The supernormal faculties they possess produce the essence of awakening and are the most supreme form of awakening, which brings about a perfect realization of all the qualities of a buddha.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ་དང་འཐུན་པའོ། །
en: The supernormal faculties they possess are consistent with the turning of the wheel of Dharma.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་འདུལ་བར་བྱེད་པའོ། །
en: The supernormal faculties they possess can tame all beings.

source: དེ་དག་གི་མངོན་པར་ཤེས་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པའི་ཕྱིར་དབང་བསྐུར་བ་ཐོབ་པའོ། །
en: The supernormal faculties they possess secure empowering authority because they have mastery over all things.

source: ཞི་བའི་བློ་གྲོས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་ལས་ཡོངས་སུ་དག་པའོ། །
en: “Śāntamati, this is the purity of the mental action of the bodhisattvas.

source: སེམས་ཡོངས་སུ་དག་པ་དེ་ཉོན་མོངས་པ་མེད་ཅིང་ཡོངས་སུ་བྱང་བ་དང་།
en: This pure mind is immaculate and without any affliction;

source: འོད་གསལ་བ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་དང་། རབ་ཏུ་དུལ་བ་དང་།
en: it is luminous, free from the derivative afflictions, and completely controlled.

source: ལེགས་པར་སྦྱངས་པས་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: By being well guarded, it rests in the states of meditation, liberation, concentration, and absorption, but it does not sink into complete extinction or a state of nonarising.

source: སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་འཇོག་ཀྱང་ཤིན་ཏུ་ཟད་པ་དང་མི་སྐྱེ་བ་ཉིད་དུ་ལྟུང་བ་ཡང་མ་ཡིན་བསམ་བཞིན་དུ་ཡང་འདིར་སྐྱེ་ལ་འདོད་པའི་ཁམས་ན་འཁྲུགས་པ་ཡང་མེད།
en: Instead, it intentionally takes birth in the desire realm and remains undisturbed by being here.

source: བཅིངས་བཞིན་དུ་སྐྱེ་བ་ཡང་མ་ཡིན།
en: It is not born in bondage.

source: བཅིངས་བཞིན་དུ་འཆི་འཕོ་བ་ཡང་མ་ཡིན། བཅིངས་བཞིན་དུ་འབྱུང་བ་ཡང་མ་ཡིན་ནོ། །
en: It does not die or transmigrate in bondage, and it is not reborn in bondage.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: How is this so?

source: དེ་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་དུ་རྟོག་པ་ལས་གྲོལ་བའོ། །
en: It is free from forming concepts, which are not real.

source: ཀུན་ནས་ཉོན་མོངས་པའི་འཆིང་བ་ལས་གྲོལ་བའོ། །
en: It is free from the bonds of all the afflictions.

source: ཕྱིན་ཅི་ལོག་ཏུ་འཛིན་པ་ལ་གནས་པ་ལས་གྲོལ་བའོ། །
en: It is free from dwelling on distorted conceptions.

source: དེས་ན་དེ་གྲོལ་བཞིན་དུ་སྐྱེའོ། །གྲོལ་བཞིན་དུ་འཆི་འཕོའོ། །གྲོལ་བཞིན་དུ་འབྱུང་ངོ་། །
en: As a result, it is born while being completely free, it dies and transmigrates while being completely free, and it is reborn while being completely free.

source: དེ་སྐྱེ་ཡང་ཐེག་པ་ཆེན་པོ་ལས་ཉམས་པ་མེད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཕུན་སུམ་ཚོགས་སོ། །
en: “Though it is born, it does not fall back from the Great Vehicle, and it becomes completely endowed with all the qualities of a buddha.

source: ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ཡོངས་སུ་ཚོལ་ཡང་མི་རྙེད་མི་དམིགས་སོ། །
en: Though one may seek for these qualities of a buddha throughout the ten directions, they cannot be found or seen anywhere.

source: དེས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ཆོས་ཐམས་ཅད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་སུ་རྟོགས་སོ། །
en: Therefore, the qualities of a buddha and of all things are realized as qualities of a buddha.

source: དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཆོས་དང་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་མ་ཡིན་ལ་ཆོས་མ་ཡིན་པ་ཡང་མ་ཡིན་པར་ཁས་ལེན་ཏོ། །
en: In this manner, the qualities of a buddha and of all things are not asserted to be things, nor are they asserted not to be things.

source: ཆོས་ཐམས་ཅད་ནི་ཀུན་དུ་བཙལ་ན་ཡང་མི་རྙེད་དོ། །མི་དམིགས་སོ། །
en: Even though one might exhaustively seek for anything and everything, one cannot find or see anything.

source: ཆོས་གང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བཙལ་ན་མི་རྙེད་ཅིང་མི་དམིགས་པ་དེ་ལ་ནི་བགྲང་བ་གང་ཡང་མེད་དེ།
en: If one seeks for things just as they really are, one cannot find or see them. One cannot enumerate them either.

source: ཆོས་ཐམས་ཅད་ནི་བགྲང་བའི་ལམ་ལས་ཡང་དག་པར་འདས་པའོ། །
en: All things completely transcend enumeration.

source: གང་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཤེས་པ་དེ་ནི་ཆོས་སམ་ཆོས་མ་ཡིན་པ་ལ་མངོན་པར་ཞེན་པ་མེད་དེ་མངོན་པར་ཞེན་པ་མེད་པ་ནི་ཆོས་རྣམས་ཀྱི་དོན་ཏོ། །
en: Whoever knows the equality of all things is free from fixating on them as being either something or nothing, and knows that being beyond such fixation is the meaning of things.

source: དོན་ལ་རློམ་སེམས་སུ་བྱེད་པ་གང་ཡིན་པ་དེ་ཉིད་དེའི་གནོད་པ་ཆེན་པོར་འགྱུར་རོ། །
en: However, those who take pride in meaning can cause great harm.

source: གང་ཡང་རློམ་སེམས་མེད་པ་ལ་ནི་དོན་ནམ་དོན་མ་ཡིན་པ་དེའི་མདུན་ན་མི་འདུག་གོ །
en: Those who do not feel such pride do not defend the claim that things have a meaning or that they do not have a meaning.

source: དོན་དུ་མི་ལྟ་བའི་བློ་ནི་གང་དུ་ཡང་ཐོགས་པ་མེད་དོ། །དེ་ནི་བློ་ཐོགས་པ་མེད་པའོ། །
en: “The mind that does not see any meaning is not impeded in any way—that is an unimpeded mind.

source: གང་བློ་ཐོགས་པ་མེད་པ་དེ་ནི་ཆགས་པ་མེད་པའོ། །
en: An unimpeded mind is not attached.

source: གང་ཆགས་པ་མེད་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའོ། །
en: What is unattached is not destroyed.

source: གང་རྒྱུན་ཆད་པ་མེད་པ་དེ་ནི་ཉམས་པ་མེད་པའོ། །
en: What is not destroyed does not decline.

source: གང་ཉམས་པ་མེད་པ་དེའི་བཙལ་བ་དོན་མེད་པར་མི་འགྱུར་རོ། །
en: What does not decline does not come into being as something for which the search has no meaning.

source: གང་གི་བཙལ་བ་དོན་མེད་པར་མི་འགྱུར་བ་དེ་ལ་སྐྱོན་མེད་དོ། །
en: Something for which the search has no meaning causes no transgression.

source: གང་ལ་སྐྱོན་མེད་པ་དེ་ལ་བདག་གི་བ་མེད་དོ། །
en: What causes no transgression is impersonal.

source: གང་ལ་བདག་གི་བ་མེད་པ་དེ་ལ་ཡོངས་སུ་འཛིན་པ་མེད་དོ། །
en: Of what is impersonal, there is no grasping.

source: གང་ལ་ཡོངས་སུ་འཛིན་པ་མེད་པ་དེ་ལ་རྩོད་པ་མེད་དོ།
en: Over what is not grasped, there is no conflict.

source: གང་ལ་རྩོད་པ་མེད་པ་དེ་ལ་འགྱེད་པ་མེད་དོ། །
en: About what is not in conflict, there are no disputes.

source: གང་ལ་འགྱེད་པ་མེད་པ་དེ་ནི་མི་རྩོད་པ་སྟེ་དགེ་སྦྱོང་གི་ཆོས་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: When there are no disputes, there is no conflict, and this is called being endowed with the qualities of an ascetic.

source: གང་དགེ་སྦྱོང་གི་ཆོས་དང་ལྡན་པ་དེ་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཉམ་པའོ། །
en: What is endowed with the qualities of an ascetic is the same as the sky and the palm of one’s hand.

source: གང་ནམ་མཁའ་དང་ལག་མཐིལ་དུ་མཉམ་པ་དེ་ནི་འདོད་པའི་ཁམས་སུ་མི་གཏོགས།
en: What is the same as the sky and the palm of one’s hand does not belong to the desire realm.

source: གཟུགས་ཀྱི་ཁམས་སུ་མི་གཏོགས། གཟུགས་མེད་པའི་ཁམས་སུ་མི་གཏོགས་སོ། །
en: It does not belong to the form realm, and it does not belong to the formless realm.

source: གང་ཐམས་ཅད་དུ་གཏོགས་པ་མ་ཡིན་པ་དེ་ལ་ནི་ཁ་དོག་མེད། རྟགས་མེད། དབྱིབས་མེད་དོ། །གང་ལ་ཁ་དོག་མེད།
en: What belongs to nothing whatsoever has no color, sign, or shape.

source: རྟགས་མེད། དབྱིབས་མེད་པ་དེ་ནི་དེ་འདྲ་བ་ཉིད་རྗེས་སུ་རྟོགས་སོ། །
en: What has no color, sign, or shape can be understood only by analogy.

source: དེ་ཅི་འདྲ་བ་རྗེས་སུ་རྟོགས་པ་དེ་འདྲ་བ་ཉིད་རབ་ཏུ་རྟོགས་སོ། །
en: What can be understood only by analogy is fully understood only by analogy.

source: ཅིའི་ཕྱིར་རྗེས་སུ་རྟོགས་པ་དང་། རབ་ཏུ་རྟོགས་པ་ཞེས་བྱ་ཞེན།
en: For what reason do I speak of ‘understanding’ and ‘full understanding’?

source: དེ་ལ་རྗེས་སུ་རྟོགས་པར་བྱ་བ་འམ། རབ་ཏུ་རྟོགས་པར་བྱ་བའི་ཆོས་ཕྲ་རབ་ཙམ་ཡང་མི་དམིགས་པས་དེའི་ཕྱིར་རྗེས་སུ་རྟོགས་པ་དང་། རབ་ཏུ་རྟོགས་པ་ཞེས་བྱ་སྟེ། ཞི་བའི་བློ་གྲོས་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བའོ། །
en: The reason is that one cannot find anything that one could understand or fully understand, not even the smallest particle, and therefore I speak of ‘understanding’ and ‘full understanding.’ Śāntamati, this is the secret of the bodhisattvas’ mind.

source: ཞི་བའི་བློ་གྲོས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་གསང་བ་ནི་གང་བྱམས་པ་ཡང་ཡིན་ལ། བདག་མེད་པ་ཉིད་ཀྱང་ཡིན།
en: “Furthermore, Śāntamati, the secret of the bodhisattvas’ mind is also that their mind is loving, even though there is no self.

source: སྙིང་རྗེ་ཡང་ཡིན་ལ། སེམས་ཅན་མེད་པ་ཉིད་ཀྱང་ཡིན།
en: It is also a mind of compassion, even though beings do not exist;

source: དགའ་བ་ཡང་ཡིན་ལ། སྲོག་མེད་པ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of joy, despite the nonexistence of a life force;

source: བཏང་སྙོམས་ཀྱང་ཡིན་ལ། གང་ཟག་མེད་པ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of equanimity, even though it is free of the defilements;

source: སྦྱིན་པ་ཡང་ཡིན་ལ། སེམས་དུལ་བ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of generosity, even though the mind is well trained;

source: ཚུལ་ཁྲིམས་ཀྱང་ཡིན་ལ། སེམས་ཞི་བ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of moral conduct, even though the nature of mind is at ease;

source: བཟོད་པ་ཡང་ཡིན་ལ། སེམས་མི་ཟད་པ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of patience, even though the nature of mind is indestructible;

source: བརྩོན་འགྲུས་ཀྱང་ཡིན་ལ། སེམས་དབེན་པ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of heroic effort, even though the mind is always in a state of solitude;

source: བསམ་གཏན་ཡང་ཡིན་ལ། སེམས་ངེས་པར་སེམས་པ་ཉིད་ཀྱང་ཡིན།
en: it is also a mind of concentration, as well as a mind engaged in profound contemplation;

source: ཤེས་རབ་ཀྱང་ཡིན་ལ། རྒྱུ་བ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: and it is also a mind of wisdom, even though the nature of mind is unwavering.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་ཡིན་ལ། དྲན་པ་ཡིད་ལ་བྱེད་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: “It is a mind that applies the applications of mindfulness even though the nature of mind is that it makes no conscious effort to apply mindfulness.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་ཀྱང་ཡིན་ལ། ཡང་དག་པར་སེམས་མཉམ་པ་ཉིད་ཀྱང་ཡིན།
en: It is a mind that makes the correct efforts even though the nature of mind is properly always the same.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཀྱང་ཡིན་ལ། སྤྲོས་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind that has the foundations for superhuman power even though the nature of mind is beyond activity.

source: དད་པ་ཡང་ཡིན་ལ། ཆགས་པ་མེད་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It has serene faith, even though the nature of mind is without attachment.

source: བརྩོན་འགྲུས་ཀྱང་ཡིན་ལ། ལྷུན་གྱིས་གྲུབ་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is a mind of heroic effort, even though the nature of mind is effortless.

source: དྲན་པ་ཡང་ཡིན་ལ། རང་བྱུང་གི་སེམས་ཉིད་ཀྱང་ཡིན།
en: It is mindful, even though the mind has the nature of arising on its own.

source: ཏིང་ངེ་འཛིན་ཀྱང་ཡིན་ལ། མཉམ་པ་ཉིད་ཤེས་པའི་སེམས་ཉིད་ཀྱང་ཡིན།
en: “It is a mind of concentration, even though the nature of mind is that it understands that everything is the same.
